ask-fm-api/app/controllers/answers_controller.rb

    def create
        question=Question.find params[:question_id]
        answer=Answer.new params.require(:answer).permit(:title);
        answer.question=question
        if answer.save
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
INSERT INTO "answers" ("title", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "new answer"], ["question_id", 16], ["created_at", "2021-04-04 19:26:04.828120"], ["updated_at", "2021-04-04 19:26:04.828120"]]

    def destroy
        answer=Answer.find params[:id]
        if answer.destroy
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 205], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 205]]