ask-fm-api/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 751], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 751]]
---
    def destroy
        comment=Comment.find params[:id]
        if comment.destroy