ask-fm-api/app/controllers/questions_controller.rb

    def index
        questions=Question.all.order created_at: :desc
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

    def create
        question = Question.new question_params
        if question.save
---
INSERT INTO "questions" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "This is test"], ["created_at", "2021-04-04 03:37:02.390672"], ["updated_at", "2021-04-04 03:37:02.390672"]]

    def destroy
        question=Question.find params[:id]
        if @question.destroy
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 15]]